[
  {
    "name": "BetterReads",
    "role": "Lead Software Developer",
    "period": "May 2025 - Present",
    "description": "Designed and built a full-stack platform inspired by Goodreads, implementing RESTful APIs in Spring Boot with DTOs and pagination for scalable data retrieval. Integrated PostgreSQL for persistence (with plans for Amazon RDS migration) and containerized services using Docker for portable deployment. Developed a responsive React frontend with TypeScript and TailwindCSS, featuring modular routing, shared state management, and search-driven UI components. Sole developer responsible for backend, frontend, and infrastructure design; versioned and tracked code with GitHub.",
    "tags": [
      "Spring Boot",
      "React",
      "TypeScript",
      "PostgreSQL",
      "Docker",
      "TailwindCSS"
    ],
    "link": "https://github.com/sakshampowdel/BetterReads"
  },
  {
    "name": "CampusMarket",
    "role": "Full-Stack Developer (Team Project)",
    "period": "Sep 2024 - Dec 2024",
    "description": "Collaborated in a 7-member Agile team (Scrum with standups, sprint planning, retrospectives) to deliver a marketplace web app for item and service listings. Developed backend REST APIs with Django REST Framework and implemented input validation for secure user interactions. Built and connected frontend and backend services, containerized them with Docker, and contributed to deployment setup in Azure DevOps pipelines. Authored unit and system tests (Pytest, Jest) achieving ~100% coverage, with CI integration to ensure reliability across features. Reviewed and merged teammate pull requests as a top contributor, reinforcing code quality and collaborative GitHub workflows.",
    "tags": [
      "React",
      "Django REST",
      "Azure",
      "Docker",
      "Pytest",
      "Jest",
      "Agile/Scrum"
    ],
    "link": ""
  },
  {
    "name": "AI Image Upscaler",
    "role": "Software Developer",
    "period": "July 2025",
    "description": "Implemented an image enhancement tool using the pretrained ESRGAN model in PyTorch, upscaling low-resolution images by 4x. Built preprocessing and postprocessing pipelines with NumPy and PIL to handle tensor conversion, normalization, and saving outputs. Packaged inference into a terminal interface for loading inputs, running deep learning inference on CPU, and saving enhanced results. Explored applied AI techniques to strengthen ML exposure and hands-on familiarity with PyTorch model deployment.",
    "tags": ["Python", "PyTorch", "ESRGAN", "NumPy", "PIL"],
    "link": "https://github.com/sakshampowdel/ai-upscaler"
  }
]
